"""
Name: {ภูริวัฒน์ เลิศไกร}
SID: {111111111111}
Group: {MIT211}
"""

"""
Question 1:
จงเขียนโปรแกรมจากจากคำสั่งต่อไปนี้
(10 คะแนน)
"""

# ประกาศตัวแปร x มีค่าเท่ากับ 100
# แสดงผลค่าตัวแปร x 
# แสดงชนิดข้อมูลของตัวแปร x 

# ประกาศตัวแปร  y มีค่าเท่ากับ 200
# แสดงผลค่าตัวแปร y
# แสดงชนิดข้อมูลของตัวแปร y 

# แสดงผลค่าตัวแปร x และ y โดยมีข้อความดังนี้  "x is 100 and y is 200" 

# ประกาศตัวแปร z มีค่าเท่ากับ ตัวแปร x ลบด้วยตัวแปร y
# แสดงผลค่าตัวแปร z โดยมีข้อความดังนี้  "z is {z}" โดยการใช้ formatted print  -- > print(f{...})

# หาผลรวมของตัวแปร x, y และ z เก็บไว้ในตัวแปร total
# แสดงผลค่าตัวแปร total โดยการใช้ formatted print  -- > print(f{...})

# หาผลลบของตัวแปร x, y และ z เก็บไว้ในตัวแปร total
# แสดงผลค่าตัวแปร total formatted print  -- > print(f{...})

# หาผลคูณของตัวแปร x, y และ z เก็บไว้ในตัวแปร total
# แสดงผลค่าตัวแปร z formatted print  -- > print(f{...})

# หาผลหารของตัวแปร x, y และ z เก็บไว้ในตัวแปร total
# แสดงผลค่าตัวแปร total formatted print  -- > print(f{...})

# หาผลหารแบบจำนวนเต็ม (floor division) ของตัวแปร x, y และ z เก็บไว้ในตัวแปร total
# แสดงผลค่าตัวแปร total formatted print  -- > print(f{...})
